tests/Functional/DataFixtures/ORM/order_awaiting_payment.yaml

Sylius\Component\Core\Model\Order:
    order:
        channel: "@channel_web"
        currencyCode: "USD"
        localeCode: "en_US"
        state: "new"
        paymentState: "awaiting_payment"
        shippingState: "ready"
        tokenValue: "token"
        customer: "@customer_oliver"
        billingAddress: "@address"
        shippingAddress: "@address"
        items: [ '@order_item', '@order_item_2' ]
        shipments: [ '@shipment' ]

Sylius\Component\Core\Model\OrderItem:
    order_item:
        variant: "@product_variant"
        order: "@order"
    order_item_2:
        variant: "@product_variant_free"
        order: "@order"

Sylius\Component\Core\Model\OrderItemUnit:
    order_item_unit:
        __construct: ['@order_item']
        createdAt: "<(new \\DateTime())>"
        updatedAt: "<(new \\DateTime())>"
    order_item_unit_2:
        __construct: [ '@order_item_2' ]
        createdAt: "<(new \\DateTime())>"
        updatedAt: "<(new \\DateTime())>"

Sylius\Component\Core\Model\Adjustment:
    adjustment_1:
        type: promotion
        label: Promotion
        amount: 1000
        neutral: false
        adjustable: '@order_item'
        createdAt: "<(new \\DateTime())>"
        updatedAt: "<(new \\DateTime())>"
    adjustment_2:
        type: order_promotion
        label: New Year
        amount: -500
        neutral: false
        adjustable: '@order_item_unit'
        createdAt: "<(new \\DateTime())>"
        updatedAt: "<(new \\DateTime())>"
    adjustment_3:
        type: shipping
        label: UPS
        amount: 500
        neutral: false
        adjustable: '@order'
        createdAt: "<(new \\DateTime())>"
        updatedAt: "<(new \\DateTime())>"

Sylius\Component\Core\Model\Shipment:
    shipment:
        method: '@shipping_method_ups'
        order: '@order'
        state: 'new'
        createdAt: "<(new \\DateTime())>"
        updatedAt: "<(new \\DateTime())>"
        adjustments: ['@adjustment_3']
        
    
